## Pandas 2

**Descritivos, Agrupamentos e Únicos**

*Autor: Danillo de Souza*

In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.DataFrame({
    "modelo": ["Monza","Gol","Palio","Uno","Corsa","Corolla","Civic"],
    "marca": ["Chevrolet","VW","Fiat","Fiat","Chevrolet","Toyota","Honda"],
    "valor": [7000,14000,10000,12000,10000,40000,35000],
    "quantidade": [5,10,8,12,6,5,7]
})
df

    modelo      marca  valor  quantidade
0    Monza  Chevrolet   7000           5
1      Gol         VW  14000          10
2    Palio       Fiat  10000           8
3      Uno       Fiat  12000          12
4    Corsa  Chevrolet  10000           6
5  Corolla     Toyota  40000           5
6    Civic      Honda  35000           7

**Métodos Descritivos**

In [3]:
df.describe()

              valor  quantidade
count      7.000000    7.000000
mean   18285.714286    7.571429
std    13375.528472    2.636737
min     7000.000000    5.000000
25%    10000.000000    5.500000
50%    12000.000000    7.000000
75%    24500.000000    9.000000
max    40000.000000   12.000000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   modelo      7 non-null      object
 1   marca       7 non-null      object
 2   valor       7 non-null      int64
 3   quantidade  7 non-null      int64
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes

In [5]:
df.count()

modelo        7
marca         7
valor         7
quantidade    7
dtype: int64

**Agrupamento de Dados**

In [6]:
df

    modelo      marca  valor  quantidade
0    Monza  Chevrolet   7000           5
1      Gol         VW  14000          10
2    Palio       Fiat  10000           8
3      Uno       Fiat  12000          12
4    Corsa  Chevrolet  10000           6
5  Corolla     Toyota  40000           5
6    Civic      Honda  35000           7

In [7]:
grupo = df.groupby("marca")
grupo['marca'].count()

marca
Chevrolet    2
Fiat         2
Honda        1
Toyota       1
VW           1
Name: marca, dtype: int64

In [8]:
grupo['modelo'].value_counts()

marca      modelo
Chevrolet  Corsa      1
           Monza      1
Fiat       Palio      1
           Uno        1
Honda      Civic      1
Toyota     Corolla    1
VW         Gol        1
Name: modelo, dtype: int64

In [9]:
grupo['valor'].mean()

marca
Chevrolet     8500
Fiat         11000
Honda        35000
Toyota       40000
VW           14000
Name: valor, dtype: int64

In [10]:
grupo['quantidade'].sum()

marca
Chevrolet    11
Fiat         20
Honda         7
Toyota        5
VW           10
Name: quantidade, dtype: int64

**Valores Únicos**

In [11]:
df['marca'].unique()

array(['Chevrolet', 'VW', 'Fiat', 'Toyota', 'Honda'], dtype=object)

In [12]:
df['marca'].nunique()

5

In [13]:
df['marca'].value_counts()

Fiat         2
Chevrolet    2
Toyota       1
VW           1
Honda        1
Name: marca, dtype: int64